{
   "TR0104":"A user was expected but not found. Either you have referred to a user by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the user.",
   "TR0105":"The view of an ancestor custom view restricts the operation you requested.",
   "TR0106":"Custom views are not allowed to perform the operation you requested.",
   "TR0107":"You cannot view the categories in a dimension that an ancestor custom view has restricted.",
   "TR0108":"An ancestor custom view excludes this measure.",
   "TR0109":"Cognos Transformer could not read the data source.",
   "TR0110":"No records were found in data source data_source_name; the file is empty.",
   "TR0111":"file_name is not a valid file name.",
   "TR0112":"There is not enough memory available.",
   "TR0113":"Cognos Transformer cannot create the file file_name.",
   "TR0114":"Cognos Transformer cannot write in the model temporary file. Please check if there is enough free disk space in the temporary directory.",
   "TR0116":"Cognos Transformer cannot open the file file_name.",
   "TR0118":"Cognos Transformer cannot read the database database_name defined in PowerCube.",
   "TR0128":"Only data source input files of the following types are supported in this mode data_source_list.",
   "TR0131":"The argument for command line option -k is invalid.",
   "TR0132":"The database name in the command line is blank.",
   "TR0133":"Unable to delete file file_name.",
   "TR0137":"Cube Group cube_group_name (and possibly others) contains cubes based upon key orphanage categories. Due to the temporary nature of these categories, the data in these cubes may belong to other cubes within their respective cube groups.",
   "TR0149":"A data input conversion or overflow error has occurred.",
   "TR0202":"You did not include any dimensions. Cognos Transformer cannot create a PowerCube.",
   "TR0203":"You did not include any measures. Cognos Transformer cannot create a PowerCube.",
   "TR0205":"Double quotes were changed to single quotes in the source value, label, description, sort value, or some other text field. This action was taken to avoid syntax errors in MDL.",
   "TR0206":"You did not include any dimensions in PowerCube cube_name. The cube was not created.",
   "TR0207":"Data source data_source_name is not related to any dimension so it cannot be processed.",
   "TR0208":"Consolidation for the PowerCube cube_name (and n others) is suppressed because a before-rollup calculation was also defined.",
   "TR0209":"Sorting and consolidation for the PowerCube cube_name (and n others) must be performed to determine correct state measure values.",
   "TR0210":"n data input conversion or overflow errors occurred. See the log file for details.",
   "TR0214":"The temporary file for source file source_file_name and PowerCube cube_name is empty. Check that your source file contains data.",
   "TR0215":"The PowerCube cube_name (and n others) may require consolidation. Consolidation can't be performed because of before-rollup calculations or because a cube is designated as using Direct Create.",
   "TR0217":"Data source data_source_name is turned off for cube generation, and the process has halted.",
   "TR0301":"There are no columns for AutoDesign to use.",
   "TR0303":"Cognos Transformer has detected invalid allocation specifications. These allocations will be removed. Do you want to continue?",
   "TR0404":"You didn't specify a server data source. Do you want to continue?",
   "TR0408":"This model was built with a system language setting of language_setting, which differs from the current setting. The language setting dictates the sorting rules used in category ordering. Do you want to resort all ordered categories?",
   "TR0412":"Error encountered while trying to save preferences to path_name_cogtr.xml",
   "TR0420":"A PowerCube group was expected but not found. Either you have referred to a PowerCube group by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the PowerCube group.",
   "TR0423":"A calculation definition was expected but not found. Either you have referred to a calculation definition by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the calculation definition.",
   "TR0476":"A category set was expected but not found. Either you have referred to a category set by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the category set.",
   "TR0500":"You cannot move a category outside its drill-down path.",
   "TR0501":"A regular category cannot be the parent of a special category.",
   "TR0502":"You must specify a category code when you create a manual category.",
   "TR0503":"Another category already has this category code. Each category requires a category code that is unique within the dimension.",
   "TR0504":"You must specify a source value for a category in a source level. You can do this from the Source tab in the Level property sheet.",
   "TR0505":"This action would result in two categories with the source value source_value under different parent categories in level level_name, which is designated as unique. The action is canceled.",
   "TR0507":"The share reference category is not a category in the same dimension.",
   "TR0508":"You cannot move a category into or out of a convergence level.",
   "TR0510":"The share category ID is invalid. A share category ID must be the object identifier of another category in the same dimension.",
   "TR0514":"You cannot delete or move the root category of a dimension.",
   "TR0515":"In a regular diagram, you can only connect to categories in a level above or below the original level. You cannot connect to categories in the same level.",
   "TR0518":"You can only create subdimensions below categories that are in a source level.",
   "TR0519":"A subdimension cannot be rooted in this level. This level is above a convergence level in a dimension that contains alternate drill-down paths.",
   "TR0523":"You cannot move this category because its position is determined by its Order Value property.",
   "TR0524":"Rollup can only be disabled for special categories.",
   "TR0525":"A category was expected but not found. Either you have referred to a category by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the category.",
   "TR0528":"The source value for a date category in a month level must be numeric. Also, it must be in the format MMDD, unless specified otherwise in the Date tab of the Column property sheet.",
   "TR0534":"The drill category cannot be deleted in a dimension with a single alternate drill down.",
   "TR0535":"A category cannot be created below a convergence level when the parent of that category is above the convergence level.",
   "TR0536":"Partitioning can only be specified for categories in a primary drill-down path.",
   "TR0538":"A partition cannot be specified for root, special, or leaf categories.",
   "TR0540":"Changing the primary drill-down path from drill_down_pathname will cause any allocations and partitioning information to be removed from the current primary drill-down path. Do you want to continue?",
   "TR0541":"A drill-down category cannot be filtered.",
   "TR0552":"Manual categories in this dimension cannot be created because the dimension is locked.",
   "TR0605":"A column was expected but not found. Either you have referred to a column by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the column.",
   "TR0606":"The specifications for the date format and the level of detail are inconsistent. Confirm these specifications in the Column property sheet.",
   "TR0607":"The data class in the Column property sheet is not compatible with the storage type in the Measure property sheet. Change the data class or change the storage type.",
   "TR0613":"Column column_name is referenced by name in one or more dimensions, levels, measures or currency tables. Deleting or modifying the column name can cause these associations to be lost. Do you want to continue?",
   "TR0621":"An association was expected but not found. Either you have referred to an association by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the association.",
   "TR0623":"One association_type association from datasource_name data source is already defined.",
   "TR0624":"One association_type association named association_name is already defined.",
   "TR0657":"The columns in data source data_source_name don't match the data source.",
   "TR0700":"This action will cause one or more cubes to be deleted in the Cube Group cube_group_name. Do you want to continue?",
   "TR0701":"A PowerCube was expected but not found. Either you have referred to a PowerCube by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the PowerCube.",
   "TR0702":"You cannot delete this PowerCube because it belongs to a cube group.",
   "TR0705":"Category category_name has been excluded from Cube Group cube_group_name. A PowerCube cannot be created in this cube group.",
   "TR0713":"In Cube Group cube_group_name, one or more cubes are based on temporary key orphanages that will be removed. Regenerate the cube group to place the data previously in the key orphanage cubes into other cubes in the cube group.",
   "TR0745":"A total of n rows in the currency data were rejected because they did not match any date in the model.",
   "TR0749":"The currency table populate failed.",
   "TR0750":"Currency table Date column not found.",
   "TR0751":"Currency table Rate column not found.",
   "TR0752":"The currency table Label or Country Code column is mandatory.",
   "TR0753":"The conversion rate entered is invalid. It either contains invalid characters or is less than or equal to zero.",
   "TR0800":"Level level_name has no date function. Cognos Transformer will not generate any date categories if they follow a non-date level.",
   "TR0802":"Levels in this time dimension are not in their natural order (year, quarter, month, day). Please re-order the levels.",
   "TR0803":"More than 1000 date categories have been generated from your specifications. Do you want to continue generating date categories?",
   "TR0804":"The earliest date is invalid.",
   "TR0805":"The latest date is invalid.",
   "TR0806":"The date is not valid.",
   "TR0807":"The earliest date is larger than the latest date. Make the earliest date smaller, or make the latest date larger.",
   "TR0808":"Invalid date format.",
   "TR0809":"The current period cannot be a special category.",
   "TR0810":"The date levels specified for this dimension are not allowed. Ensure that lunar and calendar date level functions have not been combined.",
   "TR0811":"The date specified by the year's start-day does not match the weekday specified by the week's start-day. Both dates must fall on the same day of the week.",
   "TR0812":"level_name is not a valid convergence level in this time dimension.",
   "TR0813":"The current period for dimension dimension_name was not changed because category category_code was not found.",
   "TR0815":"The interval between the year start-days for alternate drill-down paths drill_down_name1 and drill_down_name2 in dimension dimension_name must be equal to one or more whole units of time as represented by the convergence level.",
   "TR0816":"A signon was expected but not found. Either you have referred to a signon by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the signon.",
   "TR0817":"The signon may not be deleted or have its name changed because it is associated with a data source.",
   "TR0900":"There were changes to the (default) earliest date and latest date. This will cause date categories to be deleted from this dimension.",
   "TR0904":"The date level settings could generate in excess of n categories. Do you want to continue?",
   "TR0906":"The associated column that is specified for dimension dimension_name cannot be found in the Data Sources list.",
   "TR0907":"A dimension was expected but not found. Either you have referred to a dimension by an object name or object identifier that Cognos Transformeris unable to locate, or you have not referenced the dimension.",
   "TR0914":"This dimension contains an alternate drill-down path with a convergence level. All drill-down paths that share this convergence level must use the same calendar type. A mixture of calendar and lunar date functions is not supported.",
   "TR0917":"You have tried to create a Regular time dimension without providing the name of a column that provides date values for the categories in the dimension.",
   "TR0919":"Measure measure_name is an allocated measure in dimension dimension_name. Cube group cube_group_name is based on this dimension. This measure will not appear in the PowerCube (.mdc file) unless an external detail level is specified for the cube group.",
   "TR1003":"The Impromptu Query Definition contains a syntax error.",
   "TR1005":"IQD Data Source file file_name contains one or more BLOB data columns. BLOB data columns cannot be handled by Cognos Transformer.",
   "TR1100":"The import file file_name has an invalid keyword on line n.",
   "TR1101":"Cognos Transformer detected a syntax error at line n in file file_name.",
   "TR1102":"Cognos Transformer detected a model error at line n in file file_name.",
   "TR1106":"The object for the object ID given on line n is the wrong type in file file_name.",
   "TR1109":"The import file file_name contains a string on line n which contains a new line character.",
   "TR1304":"The associated column you specified for measure measure_name cannot be found in the Data Sources list.",
   "TR1307":"This measure is used as a weight by measure measure_name.",
   "TR1308":"This measure is referenced by calculated measure measure_name. Please redefine the calculated measure.",
   "TR1309":"The calculated measure cannot use Before Rollup timing because it refers to a calculated measure with an After Rollup setting.",
   "TR1310":"A measure was expected but not found. Either you have referred to a measure by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the measure.",
   "TR1312":"The type of Time State Rollup used must be the default because there are multiple time dimensions.",
   "TR1319":"Measure measure_name can be in multiple data sources, but only if the lowest levels in each regular dimension associated with those data sources are identical.",
   "TR1320":"Data sources associated with measure measure_name include levels only in the alternate drill downs and not in the primary drill down for dimension dimension_name. No source values will be in the cube for this measure.",
   "TR1502":"A data source was expected but not found. Either you have referred to a data source by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the data source.",
   "TR1503":"Choosing the Maximize Data Source Access Speed option may increase processing speed in some cases but Cognos Transformer will no longer detect multiple instances of source values in levels marked as Unique. Neither will it do unique moves.",
   "TR1601":"Cognos Transformer could not open the model file.",
   "TR1700":"The category category_name in the dimension dimension_name has n immediate descendants. This number should normally be close to 7. More levels may be appropriate in this dimension.",
   "TR1703":"A data input conversion or overflow error occurred at source record number n for measure measure_name in source file file_name.",
   "TR1900":"The wrong ID stamp was detected on cube_name. This often happens when the model is not saved after creating a PowerCube.",
   "TR1903":"Incremental update of cube_name cannot proceed because of the status_name status of an existing PowerCube.",
   "TR1907":"Cognos Transformer cannot gain access to database database_name with signon information <user ID, password>.",
   "TR2000":"The main dimension is required in the PowerCube Group.",
   "TR2001":"The main dimension is required in the time-based partitioned PowerCube cube_name. It has been omitted for custom view view_name.",
   "TR2002":"This dimension cannot be omitted for this custom view because it is the main dimension for time-based partitioned PowerCube cube_name and the custom view has been added to that cube.",
   "TR2306":"You have specified a label column. Please specify an associated column also.",
   "TR2307":"A level was expected but not found. Either you have referred to a level by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the level.",
   "TR2308":"A date function has been chosen but the dimension is not a time dimension.",
   "TR2312":"You made level level_name into a convergence level that connects two or more alternate drill-down paths. Categories in convergence levels must have unique source values. Can there be two categories in this level with the same source value?",
   "TR2313":"You are creating a level as a convergence level that connects two or more alternate drill-down paths. Categories in convergence levels must have unique source values. Is this level truly unique?",
   "TR2314":"This is not a unique level.",
   "TR2316":"The level level_name cannot be deleted because it is referenced by PowerCube cube_name.",
   "TR2317":"The level level_name is designated as unique. Source value source_value was used in an attempt to create a category in the path drill_path_1. source_value already exists in level level_name in the path drill_path_2.",
   "TR2318":"Cognos Transformer has detected n attempts to create a category in more than one path. Refer to the online help for a detailed explanation of level uniqueness.",
   "TR2319":"A convergence level in an alternate drill-down path must be unique.",
   "TR2320":"You are trying to sort a date level in descending order. This will create incorrect relative-time calculations. Do you want to continue?",
   "TR2321":"A share object level must be an ancestor of a share target level.",
   "TR2322":"A share object level must be in the same dimension as its target categories.",
   "TR2323":"The share object ID is invalid. A share object must be an object identifier of a category or level in the same dimension.",
   "TR2324":"Partitioning can only be specified for levels in the primary drill-down path.",
   "TR2325":"The Short Name column you specified for level level_name is not in the Data Sources list.",
   "TR2326":"The Description column you specified for level level_name is not in the Data Sources list.",
   "TR2502":"A view was expected but not found. Either you have referred to a view by an object name or object identifier that Cognos Transformer is unable to locate, or you have not referenced the view.",
   "TR2503":"Special categories cannot be summarized in dimension views.",
   "TR2504":"Special categories cannot be suppressed in dimension views.",
   "TR2505":"Special categories cannot be cloaked in dimension views.",
   "TR2506":"An apex action cannot be done with special categories.",
   "TR2507":"This dimension view cannot be deleted. It is pre-defined.",
   "TR2508":"This view is in use. If it is removed, references to it will use All Categories. Do you want to remove it?",
   "TR2509":"The position of the pre-defined views 'All Categories' and 'Omit Dimension' cannot be changed.",
   "TR2510":"The names of the predefined views 'All Categories' and 'Omit Dimension' cannot be changed.",
   "TR2600":"An error occurred during the creation of a PowerCube.",
   "TR2601":"An error occurred while saving.",
   "TR2606":"Cognos Transformer has detected one or more suspended models. Show the list of suspended models?",
   "TR2608":"Suspended models were not found.",
   "TR2700":"The columns in data source data_source_name don't match the original source columns.",
   "TR2701":"The columns specified by the alternate data source for PowerCube cube_name do not match the columns in Data Source data_source_name.",
   "TR2702":"There isn't a data source that is associated with dimension dimension_name.",
   "TR2703":"A column in data source data_source_name matches level level_name in dimension dimension_name by name. Values from this data source column cannot be related to categories in this level because insufficient context is specified in the data source.",
   "TR2704":"Dimension dimension_name contains an unbalanced category-tree in which not all leaf categories exist in the same level.",
   "TR2705":"PowerCube cube_name does not contain any measures.",
   "TR2706":"Level level_name can't be reached in drill-down path drill_category_name for data source data_source_name.",
   "TR2707":"Measure measure_name1 is referenced by the calculated measure measure_name2. These measures must have the same rollup timing.",
   "TR2708":"Regular measures measure_name1 and measure_name2 are referenced by the calculated measure measure_name3, which has a rollup timing of 'Before Rollup'. Therefore, both regular measures must be associated with the same data sources.",
   "TR2710":"Level level_name has an allocation specified for measure measure_name1 using measure measure_name2. The referenced measure must include a lower level in its measure scope than the measure being allocated.",
   "TR2711":"There are no data sources set for category generation.",
   "TR2712":"There are no data sources set for PowerCube creation.",
   "TR2713":"A circular allocation reference has been detected for measure measure_name1 in level level_name. Measure measure_name1 is allocated using another measure. At the same time another measure is allocated using measure_name1.",
   "TR2714":"A circular allocation reference has been detected for measure measure_name1 in category category_name. Measure measure_name1 is allocated using another measure. At the same time another measure is allocated using measure_name1.",
   "TR2715":"Measure measure_name1 is allocated by the calculated measure measure_name2. Measure measure_name1 is a component of the calculated measure.",
   "TR2716":"Category category_name is inaccessible in dimension dimension_name. No data can be reported against it in the PowerCube. A category is accessible if it or a descendant exists in a key level, or it has an ancestor with allocated measure values.",
   "TR2717":"Category category_name has no children in dimension dimension_name in at least one dimension view or Cube Group. This category cannot have a partition specified.",
   "TR2718":"Dimension dimension_name has no measures associated with it. During PowerCube generation, no data source will be able to provide data for this dimension.",
   "TR2719":"Data source data_source_name contains no measures. It is referred to as a structural data source and should come before all measure data sources in the Data Sources list.",
   "TR2720":"Measure measure_name has a time-state rollup specified. For this reason, no categories may be summarized or cloaked in time dimension views. Category category_name is summarized or cloaked in at least one view in dimension dimension_name.",
   "TR2723":"A gap has been detected between partition n and n+1. No gaps in partition numbers are permitted.",
   "TR2724":"Partition n is defined in dimensions dimension_name1 and dimension_name2. A partition number cannot be assigned in more than one dimension.",
   "TR2725":"Category category_name1 is a descendant of category category_name2 and shares the same partition number in dimension dimension_name. A partition number can only occur once in a category path of a dimension.",
   "TR2726":"Category category_name1 is a descendant of category category_name2 in dimension dimension_name. The partition number specified for category_name2 cannot be greater than the partition number of category_name1.",
   "TR2727":"Measure measure_name1 is an allocated measure which is referenced by the Before Rollup calculated measure measure_name2. A Before Rollup calculated measure cannot have allocated measures as components.",
   "TR2728":"Data Source data_source_name is an .iqd definition which references database database_name. This database has no database type specified.",
   "TR2729":"Measure measure_name has a time state rollup specified. This measure does not touch the lowest level in dimension dimension_name causing time state rollup values to be zero in any cubes that reference this measure.",
   "TR2731":"Cube group cube_group_name is not defined in the primary drill-down path in dimension dimension_name. A cube group must be specified in the primary drill down of a dimension that has alternate drill downs.",
   "TR2732":"The target category category_name in cube group cube_group_name which summarizes external categories cannot be suppressed or cloaked in any dimension views in dimension dimension_name.",
   "TR2733":"Data Source data_source_name is not associated with any dimensions that are included in cube cube_name. This data source will be ignored during PowerCube (.mdc file) generation.",
   "TR2734":"All cubes have been disabled. PowerCube (.mdc file) generation is not possible.",
   "TR2735":"Measure measure_name1 has an average regular rollup with a weighted measure measure_name2 specified. Both measures must exist in the same data source in order for the weighted measure to be applied.",
   "TR2736":"Measure measure_name1 has an average time-state rollup with a weighted measure measure_name2 specified. Both measures must exist in the same data source in order for the weighted measure to be applied.",
   "TR2737":"Measure measure_name1 has an average duplicates rollup with a weighted measure measure_name2 specified. Both measures must exist in the same data source in order for the weighted measure to be applied.",
   "TR2740":"Measure measure_name has a time-state rollup specified. There is no time dimension in this model so the time-state rollup setting will have no effect.",
   "TR2800":"Cognos Transformer could not read the connection information for database database_name from file cs7g.ini.",
   "TR3101":"Cognos Transformer could not create the directory directory_name.",
   "TR3124":"The root user class identifier in the model file was not found in the namespace. Ensure that you have selected the Series 7 namespace that corresponds to the model file.",
   "TR3311":"An error occurred during data retrieval from the database. If available, refer to the Details for more information.",
   "TR3519":"This calculated category definition is not valid."
}
